namespace ConsoleApp1
{
    // task1 intervals
    // на вход подается строка типа "1-6,8-9,11" - это представление исходного множества через
    // интервалы подряд идущих цифр. Нужно из этой строки получить исходное множество чисел
    // из которых была построенна эта строка. Ответ должен быть осортирован в порядке возрастания
    //


    //task2 Snow
        /*    На планете началась вечная зима, теперь выпавший снег совсем перестал таять.Каждый день выпадает несколько миллиметров снега, после чего метеостанция замеряет глубину снега в одном месте и записывает её на отдельный лист в журнал.Достоверно известно, что перед первым днем замеров снега не было вовсе, а далее на протяжении всего периода замеров за день выпадало положительное целое число миллиметров снега.
         *    
        Вы получили в распоряжение журнал, чтобы проверить, не допустили ли ошибку на метеостанции при заполнении по случайности или из злого умысла. Но перед его изучением решили выпить чашечку кофе (вечная зима на дворе!) и случайно разлили его на журнал.В результате чего на некоторых его листах оказались неразличимые кляксы.
        Теперь вы просто хотите найти количество снега в миллиметрах, которое могло выпасть в каждый день замера или обличить метеостанцию в подтасовке, если по испорченному журналу можно достоверно сказать, что данные фальсифицированы.
        Среди всех вариантов ответа вас устроит любой, главное, чтобы он согласовывался с сохранившимися данными из испорченного журнала.
        Формат входных данных
        В первой строке входных данных содержится число n (1≤𝑛≤10^5) — количество дней, на протяжении которых проводились замеры.
        Во второй строке содержатся n целых чисел 𝑎𝑖, разделенных пробелом.
        равно - 1, если соответствующий лист нечитаемый, а иначе это число, записанное на i-м листе, в этом случае 𝑎𝑖 не превосходит 10^9
        Формат выходных данных
        Если в журнале была допущена ошибка, выведите «NO» (без кавычек). В противном случае, в первой строке выведите «YES»,
        а во второй строке выведите n натуральных чисел от 1 до 10^9 i-е из которых равняется количеству выпавшего снега в i-й день.
        */
}
